package com.project.project.utilits;

import java.security.SecureRandom;
import java.util.Random;


public class RandomStringGenerator {
    private static final String CHARACTERS = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz";
    private static final String[] firstNames = {"Александр", "Иван", "Михаил", "Дмитрий", "Кирилл", "Никита", "Алексей", "Артём", "Олег",
            "Сергей", "Владимир", "Юрий", "Павел", "Максим", "Роман", "Егор", "Артур", "Тимур",
            "Виктор", "Анатолий", "Евгений", "Игорь", "Руслан", "Станислав", "Василий", "Петр", "Марк",
            "Леонид", "Тарас", "Борис", "Константин", "Вадим", "Глеб", "Елисей", "Даниил", "Фёдор",
            "Георгий", "Матвей", "Денис", "Валерий", "Ярослав", "Лев", "Антон", "Захар", "Назар",
            "Виталий", "Григорий", "Илья", "Владислав", "Андрей", "Степан", "Николай", "Оскар", "Геннадий",
            "Емельян", "Клим", "Давид", "Платон", "Савелий", "Тихон", "Ян", "Радомир", "Филипп",
            "Вячеслав", "Валентин", "Тимофей", "Платон", "Юлиан", "Лука", "Данила", "Еремей", "Святослав",
            "Адам", "Ростислав", "Арсений", "Марат", "Самуил", "Авдеев", "Исаак", "Мстислав", "Семён",
            "Герман", "Мирослав", "Остап", "Игнат", "Олесь", "Прохор", "Лазарь", "Мирон", "Всеволод",
            "Яков", "Лукий", "Федот", "Эдуард", "Валентин", "Сидор", "Агап", "Макар", "Аркадий",
            "Артемий", "Бронислав", "Вадим"
    };
    private static final String[] lastNames = {"Иванов", "Петров", "Сидоров", "Ткачев", "Ковалев", "Федоров", "Гусев", "Титов", "Кузнецов", "Кудряшов",
            "Баранов", "Куликов", "Алексеев", "Степанов", "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров", "Борисов",
            "Королев", "Герасимов", "Пономарев", "Григорьев", "Лазарев", "Медведев", "Ершов", "Никитин", "Соболев", "Рябов",
            "Поляков", "Цветков", "Данилов", "Жуков", "Фролов", "Журавлев", "Николаев", "Крылов", "Максимов", "Сидоров",
            "Осипов", "Белоусов", "Федотов", "Дорофеев", "Егоров", "Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов",
            "Петухов", "Антонов", "Тимофеев", "Никифоров", "Веселов", "Филиппов", "Марков", "Большаков", "Суханов", "Миронов",
            "Ширяев", "Александров", "Коновалов", "Шестаков", "Казаков", "Ефимов", "Денисов", "Громов", "Зайцев", "Давыдов",
            "Мельников", "Щербаков", "Блинов", "Колесников", "Карпов", "Афанасьев", "Власов", "Маслов", "Исаков", "Тихонов",
            "Аксенов", "Гаврилов", "Родионов", "Котов", "Горбунов", "Кудрявцев", "Быков", "Зуев", "Третьяков", "Савельев",
            "Панов", "Рыбаков", "Суворов", "Абрамов", "Воронов", "Мухин", "Архипов", "Трофимов", "Мартынов", "Емельянов"
    };
    private static final Random random = new Random();

    public static String GenerateRandomMail(int length) {
        SecureRandom random = new SecureRandom();
        StringBuilder sb = new StringBuilder(length);
        for (int i = 0; i < length; i++) {
            int randomIndex = random.nextInt(CHARACTERS.length());
            sb.append(CHARACTERS.charAt(randomIndex));
        }
        return sb.toString() + "@gmail.com";
    }

    public static String GenerateRandomFirstname() {
        return firstNames[random.nextInt(firstNames.length)];
    }

    public static String GenerateRandomLastname() {
        return lastNames[random.nextInt(lastNames.length)];
    }

    public static int GenerateRandomInteger(int min, int max) {
        return random.nextInt(max - min + 1) + min;
    }
}
